# Taps
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "azure/functions"
tap "heroku/brew"

# Main
brew "chezmoi"
brew "mas"
brew "tree"

# Code etc
brew "azure-functions-core-tools"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hugo"
brew "azure-cli"
brew "python@3.10"
brew "git"
brew "jq"

# Casks
cask "alfred"
cask "fork"
cask "iterm2"
cask "powershell"
cask "spotify"
cask "visual-studio-code"
cask "authy"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "usr-sse2-rdm" # RDM for display resolution
cask "rectangle"
cask "microsoft-office"
cask "android-sdk"
cask "android-studio"
cask "keka"

#App Store
mas "Amphetamine", id: 937984704
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
